In [5]:
import pandas as pd
df = pd.read_csv("/Users/periyzat/Documents/Study/Programming/MLCodebasics/14/titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [6]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [7]:
inputs=df.drop('Survived', axis='columns')
target=df.Survived

In [8]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [9]:
inputs=pd.concat([inputs,dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [10]:
inputs.drop("Sex",axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [11]:
inputs.columns[inputs.isna().any()] #checking wether any column contains NA value and it's returning that "Age" contains

Index(['Age'], dtype='object')

In [12]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [17]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(7)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1
6       1  54.000000  51.8625       0     1

In [18]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [20]:
len(inputs)

891

In [21]:
len(x_train)

712

In [22]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [23]:
model.fit(x_train,y_train)

GaussianNB()

In [24]:
model.score(x_test, y_test)

0.7486033519553073

In [25]:
x_test[:10]

     Pclass        Age    Fare  female  male
706       2  45.000000  13.500       1     0
690       1  31.000000  57.000       0     1
886       2  27.000000  13.000       0     1
394       3  24.000000  16.700       1     0
545       1  64.000000  26.000       0     1
211       2  35.000000  21.000       1     0
166       1  29.699118  55.000       1     0
729       3  25.000000   7.925       1     0
282       3  16.000000   9.500       0     1
648       3  29.699118   7.550       0     1

In [26]:
y_test[:10]

706    1
690    1
886    0
394    1
545    0
211    1
166    1
729    0
282    0
648    0
Name: Survived, dtype: int64

In [28]:
model.predict(x_test[:10])

array([1, 0, 0, 1, 0, 1, 1, 1, 0, 0])

In [29]:
model.predict_proba(x_test[:10])

array([[0.02515636, 0.97484364],
       [0.84860781, 0.15139219],
       [0.98253543, 0.01746457],
       [0.05343041, 0.94656959],
       [0.8825983 , 0.1174017 ],
       [0.02626822, 0.97373178],
       [0.00275481, 0.99724519],
       [0.05265538, 0.94734462],
       [0.99020779, 0.00979221],
       [0.99224218, 0.00775782]])

In [ ]:
# x-died; y-survived that's why model is predicting 1 for this person(first element of model.predict(x_test[:10]) array)